tests/MySQL/src/tests/scripts/latency_profiler/lite/sysbench.log
root@774e0794e9a7:/# sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=mysql --report-interval=1 --tables=1 --table-size=1000000 --threads=1 --time=10 --mysql-host=mysql-server --mysql-port=59999 --mysql-user=sbtest --mysql-password=password --db-ps-mode=disable --mysql-ignore-errors=2013,1062 --skip_trx=on run
sysbench 1.0.17 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 46.86 qps: 843.51 (r/w/o: 656.07/187.45/0.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 51.97 qps: 940.51 (r/w/o: 732.62/207.89/0.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 46.96 qps: 845.32 (r/w/o: 657.47/187.85/0.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 49.95 qps: 904.05 (r/w/o: 704.26/199.79/0.00) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 42.96 qps: 776.33 (r/w/o: 604.48/171.85/0.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 45.00 qps: 799.01 (r/w/o: 619.01/180.00/0.00) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 46.18 qps: 843.21 (r/w/o: 658.51/184.70/0.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 47.82 qps: 859.73 (r/w/o: 668.46/191.27/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 46.00 qps: 828.99 (r/w/o: 644.99/184.00/0.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 52.00 qps: 933.99 (r/w/o: 725.99/208.00/0.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            6678
        write:                           1908
        other:                           0
        total:                           8586
    transactions:                        477    (47.65 per sec.)
    queries:                             8586   (857.72 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0076s
    total number of events:              477

Latency (ms):
         min:                                   10.73
         avg:                                   20.97
         max:                                   40.04
         95th percentile:                       24.38
         sum:                                10002.84

Threads fairness:
    events (avg/stddev):           477.0000/0.00
    execution time (avg/stddev):   10.0028/0.00